Core/src/Documents/МинимальныеОстаткиСклада/МинимальныеОстаткиСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МинимальныеОстаткиСклада</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.МинимальныеОстаткиСклада</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/МинимальныеОстаткиСклада/МинимальныеОстаткиСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МинимальныеОстаткиСклада</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Documents/МинимальныеОстаткиСклада/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МинимальныеОстаткиСкладаЗапасы.Ссылка КАК Регистратор,
		|	МинимальныеОстаткиСкладаЗапасы.Ссылка.Дата КАК Период,
		|	МинимальныеОстаткиСкладаЗапасы.Ссылка.СтруктурнаяЕдиница,
		|	МинимальныеОстаткиСкладаЗапасы.Номенклатура,
		|	МинимальныеОстаткиСкладаЗапасы.Количество
		|ИЗ
		|	Документ.МинимальныеОстаткиСклада.Запасы КАК МинимальныеОстаткиСкладаЗапасы
		|ГДЕ
		|	МинимальныеОстаткиСкладаЗапасы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ЗагружаемаяТаблица = Запрос.Выполнить().Выгрузить();
	
	
	Регистр_МинимальныеОстаткиСклада = РегистрыСведений.МинимальныеОстаткиСклада;
	НаборМинимальныеОстаткиСклада = Регистр_МинимальныеОстаткиСклада.СоздатьНаборЗаписей();
	НаборМинимальныеОстаткиСклада.Отбор.Регистратор.Установить(Ссылка);
	НаборМинимальныеОстаткиСклада.Загрузить(ЗагружаемаяТаблица);
	НаборМинимальныеОстаткиСклада.Записать(Истина);
	
КонецПроцедуры
